const questions = [
  {
    id: "01",
    question: "一天當中，通常什麼時候你的心情是最好的？",
    answer: [
      ["早上", "2"],
      ["下午及傍晚", "4"],
      ["夜裡", "6"],
    ],
  },
  {
    id: "02",
    question: "你平常走路的速度？",
    answer: [
      ["步伐很大、頻率較快", "6"],
      ["步伐很小、頻率較快", "4"],
      ["走的不快、頭往上看", "7"],
      ["走的不快、頭往下看", "2"],
      ["很慢", "1"],
    ],
  },
  {
    id: "03",
    question: "和別人交談時，你的姿態通常是？",
    answer: [
      ["雙手交疊站立", "4"],
      ["雙手緊握", "2"],
      ["一支手或雙手放在臀部", "5"],
      ["觸碰與你交談的對象", "7"],
      ["不自覺摸著耳朵、下巴或是整理頭髮", "6"],
    ],
  },
  {
    id: "04",
    question: "睡覺之前，通常你的床上姿勢為何？",
    answer: [
      ["仰躺、伸直", "7"],
      ["趴睡、伸直", "6"],
      ["側躺、微捲", "4"],
      ["頭睡在一側手臂上", "2"],
      ["被子蓋過頭", "1"],
    ],
  },
  {
    id: "05",
    question: "做夢時的你，常常遇見什麼？",
    answer: [
      ["落下", "4"],
      ["打架或掙扎", "2"],
      ["找東西找人", "3"],
      ["飛或漂浮", "5"],
      ["平常不太做夢", "6"],
      ["做夢都是愉快的夢", "1"],
    ],
  },
  {
    id: "06",
    question: "當你坐著休息時，你的姿態通常是？",
    answer: [
      ["膝蓋併攏", "4"],
      ["雙腿交叉", "6"],
      ["雙腿伸直", "2"],
      ["單腿盤在椅子上", "1"],
    ],
  },
  {
    id: "07",
    question: "下列顏色中，你較喜歡哪色？",
    answer: [
      ["紅或橘色", "6"],
      ["黑色", "7"],
      ["黃色或淺藍色", "5"],
      ["綠色", "4"],
      ["紫色或深藍色", "3"],
      ["白色", "2"],
      ["棕色或灰色", "1"],
    ],
  },
  {
    id: "08",
    question: "當你專心在做某件事，但被人打斷了，你通常會怎麼做？",
    answer: [
      ["歡迎他，與他對話", "6"],
      ["非常厭惡", "2"],
      ["在上述兩者之間", "4"],
    ],
  },
  {
    id: "09",
    question: "當你出席公司派對或是朋友KTV聚會等場所，你通常以什麼形式入場？",
    answer: [
      ["很大聲入場，引起大家注意", "6"],
      ["安靜入場，找你認識的人", "4"],
      ["極安靜入場，盡量不引起注意", "2"],
    ],
  },
  {
    id: 10,
    question: "當你遇到開心的事情時，你的笑聲通常是？",
    answer: [
      ["類似欣賞的大笑", "6"],
      ["笑著、聲音不大", "4"],
      ["輕聲呵呵笑", "3"],
      ["羞怯的微笑", "5"],
    ],
  },
];

export default questions;
